stories/notes/micro-manager.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="description" content="Notes on using Micro-Manager">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Micro-Manager | Kyle M. Douglass</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="http://kmdouglass.github.io/stories/notes/micro-manager.html">
<!--[if lt IE 9]><![endif]--><meta name="description" itemprop="description" content="Notes on using Micro-Manager">
<meta name="author" content="Kyle M. Douglass">
<meta property="og:site_name" content="Kyle M. Douglass">
<meta property="og:title" content="Micro-Manager">
<meta property="og:url" content="http://kmdouglass.github.io/stories/notes/micro-manager.html">
<meta property="og:description" content="Notes on using Micro-Manager">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2015-05-07T09:29:44+02:00">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Menubar -->

<nav class="navbar navbar-default navbar-fixed-top" role="navigation"><div class="container">
<!-- This keeps the margins nice -->
        <div class="navbar-header">
            <button type="button" class="navbar-toggle" data-toggle="collapse" data-target=".navbar-ex1-collapse">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="http://kmdouglass.github.io/">

                <span id="blog-title">Kyle M. Douglass</span>
            </a>
        </div>
<!-- /.navbar-header -->
        <div class="collapse navbar-collapse navbar-ex1-collapse">
            <ul class="nav navbar-nav">
<li>
<a href="../../archive.html">Archive</a>
                </li>
<li>
<a href="../../categories/index.html">Tags</a>
                </li>
<li>
<a href="../notes-and-projects.html">Notes</a>
                </li>
<li>
<a href="../about-me.html">About</a>
                </li>
<li>
<a href="../contact.html">Contact</a>
                </li>
<li>
<a href="../../rss.xml">RSS feed</a>

                
            </li>
</ul>
<ul class="nav navbar-nav navbar-right">
<li>
    <a href="micro-manager.org" id="sourcelink">Source</a>
    </li>

                
            </ul>
</div>
<!-- /.navbar-collapse -->
    </div>
<!-- /.container -->
</nav><!-- End of Menubar --><div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        <div class="row">
            
            
<article class="storypage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="#" class="u-url">Micro-Manager</a></h1>

        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li>
<a href="micro-manager.html#sec-1">Accessing MMCore Java wrappers in Matlab</a>
<ul>
<li><a href="micro-manager.html#sec-1-1">Location of the .jar files</a></li>
<li><a href="micro-manager.html#sec-1-2">Test that Matlab can access the MM .jar files</a></li>
<li><a href="micro-manager.html#sec-1-3">Don't use ~ to reference the home directory</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Accessing MMCore Java wrappers in Matlab</h2>
<div class="outline-text-2" id="text-1">
<p>
I want to access the Java wrappers to easily read image file stack
metadata in Matlab. Unfortunately, it appears like the Micro-Manager
documentation on this is not too clear. The documentation I am
currently looking at on May 7, 2015 is here:
<a href="https://www.micro-manager.org/wiki/Micro-Manager_File_Formats">https://www.micro-manager.org/wiki/Micro-Manager_File_Formats</a>
</p>

<hr>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Location of the .jar files</h3>
<div class="outline-text-3" id="text-1-1">
<p>
I used the Matlab script for identifying all the .jar files in the
MM directory that is mentioned <a href="https://micro-manager.org/wiki/Matlab_Configuration">at this link</a> and included below:
</p>

<div class="highlight"><pre><span class="k">function</span><span class="w"> </span>[] <span class="p">=</span><span class="w"> </span><span class="nf">MMsetup_javaclasspath</span><span class="p">(</span>path2MM<span class="p">)</span><span class="w"></span>
<span class="n">fileList</span> <span class="p">=</span> <span class="n">getAllFiles</span><span class="p">(</span><span class="n">path2MM</span><span class="p">);</span>
<span class="n">fileListJarBool</span> <span class="p">=</span> <span class="n">regexp</span><span class="p">(</span><span class="n">fileList</span><span class="p">,</span><span class="s">'.jar$'</span><span class="p">,</span><span class="s">'end'</span><span class="p">);</span>
<span class="n">fileListJarBool</span> <span class="p">=</span> <span class="n">cellfun</span><span class="p">(@</span><span class="nb">isempty</span><span class="p">,</span><span class="n">fileListJarBool</span><span class="p">);</span>
<span class="n">fileListJar</span> <span class="p">=</span> <span class="n">fileList</span><span class="p">(</span><span class="o">~</span><span class="n">fileListJarBool</span><span class="p">);</span>
<span class="n">fid</span> <span class="p">=</span> <span class="n">fopen</span><span class="p">(</span><span class="n">fullfile</span><span class="p">(</span><span class="n">prefdir</span><span class="p">,</span><span class="s">'MMjavaclasspath.txt'</span><span class="p">),</span><span class="s">'w'</span><span class="p">);</span>
<span class="n">fprintf</span><span class="p">(</span><span class="n">fid</span><span class="p">,</span><span class="s">'&amp;lt;before&amp;gt;\r\n'</span><span class="p">);</span>
<span class="n">cellfun</span><span class="p">(@(</span><span class="n">x</span><span class="p">)</span> <span class="n">fprintf</span><span class="p">(</span><span class="n">fid</span><span class="p">,</span><span class="s">'%s\r\n'</span><span class="p">,</span><span class="n">x</span><span class="p">),</span> <span class="n">fileListJar</span><span class="p">);</span>
<span class="n">fclose</span><span class="p">(</span><span class="n">fid</span><span class="p">);</span>
<span class="c">%% nested directory listing ala gnovice from stackoverflow</span>
<span class="c">% inputs and outputs are self-explanatory</span>
<span class="k">function</span><span class="w"> </span>fileList <span class="p">=</span><span class="w"> </span><span class="nf">getAllFiles</span><span class="p">(</span>dirName<span class="p">)</span><span class="w"></span>
<span class="n">dirData</span> <span class="p">=</span> <span class="n">dir</span><span class="p">(</span><span class="n">dirName</span><span class="p">);</span>      <span class="c">% Get the data for the current directory</span>
<span class="n">dirIndex</span> <span class="p">=</span> <span class="p">[</span><span class="n">dirData</span><span class="p">.</span><span class="n">isdir</span><span class="p">];</span>  <span class="c">% Find the index for directories</span>
<span class="n">fileList</span> <span class="p">=</span> <span class="p">{</span><span class="n">dirData</span><span class="p">(</span><span class="o">~</span><span class="n">dirIndex</span><span class="p">).</span><span class="n">name</span><span class="p">}</span><span class="s">';  % Get a list of the files</span>
<span class="s">if ~isempty(fileList)</span>
<span class="s">    fileList = cellfun(@(x) fullfile(dirName,x),fileList,'</span><span class="n">UniformOutput</span><span class="o">'</span><span class="p">,</span><span class="n">false</span><span class="p">);</span>
<span class="k">end</span>
<span class="n">subDirs</span> <span class="p">=</span> <span class="p">{</span><span class="n">dirData</span><span class="p">(</span><span class="n">dirIndex</span><span class="p">).</span><span class="n">name</span><span class="p">};</span>  <span class="c">% Get a list of the subdirectories</span>
<span class="n">validIndex</span> <span class="p">=</span> <span class="o">~</span><span class="n">ismember</span><span class="p">(</span><span class="n">subDirs</span><span class="p">,{</span><span class="s">'.'</span><span class="p">,</span><span class="s">'..'</span><span class="p">});</span>  <span class="c">% Find index of subdirectories</span>
<span class="c">%   that are not '.' or '..'</span>
<span class="k">for</span> <span class="n">iDir</span> <span class="p">=</span> <span class="nb">find</span><span class="p">(</span><span class="n">validIndex</span><span class="p">)</span>                  <span class="c">% Loop over valid subdirectories</span>
    <span class="n">nextDir</span> <span class="p">=</span> <span class="n">fullfile</span><span class="p">(</span><span class="n">dirName</span><span class="p">,</span><span class="n">subDirs</span><span class="p">{</span><span class="n">iDir</span><span class="p">});</span>    <span class="c">% Get the subdirectory path</span>
    <span class="n">fileList</span> <span class="p">=</span> <span class="n">vertcat</span><span class="p">(</span><span class="n">fileList</span><span class="p">,</span> <span class="n">getAllFiles</span><span class="p">(</span><span class="n">nextDir</span><span class="p">));</span>  <span class="c">% Recursively call getAllFiles</span>
<span class="k">end</span>
</pre></div>

<p>
This .m file should be run as a function whose argument is a string of
the Micro-Manager install directory. <b>On my Debian Linux system, the
install directory is <i>usr/local/ImageJ/plugins/Micro-Manager</i></b>, NOT
the directory containing the source code. The function will create a
.txt file in Matlab's <i>prefdir</i> directory (which is ~/.matlab/R2014a/
on my system) called <i>MMjavaclasspath.txt</i>. I copied all the lines
except for the first one, which was the word `before' in angle
brackets, into the file <i>javaclasspath.txt</i>. I also inserted
<code>/usr/local/ImageJ/ij.jar</code> into this file as the first line.
</p>

<p>
Next, I restarted Matlab since it <a href="http://www.mathworks.com/help/matlab/matlab_external/bringing-java-classes-and-methods-into-matlab-workspace.html">requires a restart to access .jar
files added to the static class path</a>.
</p>

<hr>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Test that Matlab can access the MM .jar files</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Once the static class path has been updated and Matlab restarted,
test that Matlab can see the .jar files using this code:
</p>

<div class="highlight"><pre><span class="n">import</span> <span class="n">mmcorej</span><span class="o">.*</span>
<span class="n">mmc</span> <span class="p">=</span> <span class="n">CMMCore</span><span class="p">;</span>
<span class="n">mmc</span><span class="p">.</span><span class="n">loadSystemConfiguration</span> <span class="p">(</span><span class="s">'/usr/local/ImageJ/MMConfig_Demo.cfg'</span><span class="p">);</span>
</pre></div>

<p>
Note that you may need to download MMConfig_Demo.cfg from
<a href="https://micro-manager.org/wiki/File:MMConfig_Demo.cfg">https://micro-manager.org/wiki/File:MMConfig_Demo.cfg</a>.
</p>

<hr>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">Don't use ~ to reference the home directory</h3>
<div class="outline-text-3" id="text-1-3">
<p>
I discovered after a while that directories in javaclasspath.txt
won't work if you use the tilde (~) to reference your home
directory. Use the full path instead in directory names instead.
</p>

<hr>
<div id="disqus_thread"></div>
<script type="text/javascript">
    /* * * CONFIGURATION VARIABLES: EDIT BEFORE PASTING INTO YOUR WEBPAGE * * */
    var disqus_shortname = 'Kyle M. Douglass'; // Required - Replace '<example>' with your forum shortname

    /* * * DON'T EDIT BELOW THIS LINE * * */
    (function() {
        var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
        dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
        (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
    })();
</script><noscript>Please enable JavaScript to view the <a href="https://disqus.com/?ref_noscript">comments powered by Disqus.</a>
</noscript>
</div>
</div>
</div>
    </div>
    

</article>
</div>
        <!--End of body content-->

        <footer>
            Contents © 2015         <a href="mailto:kyle.douglass@epfl.ch">Kyle M. Douglass</a> - Powered by         <a href="http://getnikola.com" rel="nofollow">Nikola</a>         
            
        </footer>
</div>
</div>


            <script src="../../assets/js/all-nocdn.js"></script><script>$('a.image-reference:not(.islink)').colorbox({rel:"gal",maxWidth:"100%",maxHeight:"100%",scalePhotos:true});</script><!-- fancy dates --><script>
    moment.locale("");
    fancydates(0, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates -->
</body>
</html>
